tutorials/lagrangian/reactingParcelFoam/airRecirculationRoom/steady/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

[[ -d constant/polyMesh ]] || runApplication ./Allrun.pre

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar -latestTime

#------------------------------------------------------------------------------